tap "aquasecurity/trivy"
tap "fluxcd/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "spacelift-io/spacelift"
brew "ansible"
brew "argocd"
brew "awscli", link: false
brew "python@3.10"
brew "azure-cli"
brew "bat"
brew "berkeley-db"
brew "glib"
brew "cfssl"
brew "checkov"
brew "consul-template"
brew "desk"
brew "docker"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gotests"
brew "grep"
brew "hadolint"
brew "helm"
brew "jenkins-lts", restart_service: true
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "make"
brew "minikube"
brew "node"
brew "opa"
brew "python@3.9"
brew "qemu"
brew "task", link: false
brew "terraform"
brew "tilt"
brew "tmux"
brew "tree"
brew "wget"
brew "yq"
brew "aquasecurity/trivy/trivy"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "goreleaser/tap/goreleaser"
brew "hashicorp/tap/vault"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "spacelift-io/spacelift/spacectl"
cask "1password"
cask "google-cloud-sdk"
cask "postman"
cask "zoom"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "PKief.material-icon-theme"
