# ============================================================================
# Unified Brewfile - macOS Development Setup
# ============================================================================
# Installation: brew bundle --file=Brewfile
# Or run: ./bootstrap.sh (which includes this)
# ============================================================================

# ----------------------------------------------------------------------------
# Taps
# ----------------------------------------------------------------------------
tap "hashicorp/tap"

# ----------------------------------------------------------------------------
# Shell & Terminal
# ----------------------------------------------------------------------------
brew "zsh"
brew "bash"
brew "bash-completion"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "tmux"
brew "screen"
cask "iterm2"

# ----------------------------------------------------------------------------
# Development Tools & IDEs
# ----------------------------------------------------------------------------
brew "git"
brew "gh"                    # GitHub CLI
brew "node"
brew "python3"
brew "go"
brew "rust"
cask "visual-studio-code"
cask "cursor"               # AI-powered code editor

# ----------------------------------------------------------------------------
# Version Managers
# ----------------------------------------------------------------------------
brew "pyenv"
brew "tfenv"

# ----------------------------------------------------------------------------
# Go Tools
# ----------------------------------------------------------------------------
brew "golangci-lint"
brew "goreleaser"
brew "gotests"

# ----------------------------------------------------------------------------
# Infrastructure as Code
# ----------------------------------------------------------------------------
brew "opentofu"             # Open source Terraform alternative
brew "terragrunt"
brew "hashicorp/tap/vault"
brew "hadolint"             # Dockerfile linter

# ----------------------------------------------------------------------------
# Kubernetes Tools
# ----------------------------------------------------------------------------
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "krew"
brew "helm"
brew "k3d"
brew "kind"
brew "minikube"
brew "skaffold"
brew "kustomize"
brew "tilt"

# ----------------------------------------------------------------------------
# Container Tools
# ----------------------------------------------------------------------------
brew "dive"                 # Explore Docker image layers
brew "crane"                # Container registry tool

# ----------------------------------------------------------------------------
# Cloud & Virtualization Tools
# ----------------------------------------------------------------------------
brew "localstack"           # AWS local testing
brew "lima"                 # Linux virtual machines
brew "qemu"                 # Generic virtualization
brew "traefik"              # Reverse proxy

# ----------------------------------------------------------------------------
# DevOps & Cloud Tools
# ----------------------------------------------------------------------------
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "task"                 # Task runner
brew "opa"                  # Open Policy Agent
brew "cfssl"                # CloudFlare SSL
brew "ko"                   # Kubernetes image builder

# ----------------------------------------------------------------------------
# System Tools & CLI Utilities
# ----------------------------------------------------------------------------
brew "make"
brew "tree"
brew "wget"
brew "vim"
brew "postgresql"
brew "libssh"
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast grep alternative
brew "fd"                   # Fast find alternative
brew "direnv"               # Directory-based env vars
brew "bats"                 # Bash testing framework
brew "tlrc"                 # Simplified man pages (tldr replacement)
brew "shellcheck"           # Shell script linter
brew "telnet"
brew "coreutils"
brew "findutils"
brew "grep"
brew "less"
brew "gawk"
brew "gnutls"
brew "parallel"
brew "ncdu"                 # Disk usage analyzer
brew "watch"
brew "openssl"
brew "openssh"
brew "protobuf"
brew "dockutil"             # Manage macOS Dock

# ----------------------------------------------------------------------------
# Security & Encryption
# ----------------------------------------------------------------------------
brew "gnupg"
brew "gpg"

# ----------------------------------------------------------------------------
# Desktop Applications
# ----------------------------------------------------------------------------
cask "rectangle"            # Window management
cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"
cask "notion"               # Note-taking & productivity
cask "whatsapp"             # Messaging
cask "zoom"                 # Video conferencing
cask "microsoft-teams"      # Team collaboration
cask "orbstack"             # Fast Docker & Linux on macOS

# ----------------------------------------------------------------------------
# Fonts (for Powerlevel10k)
# ----------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"

# Note: VS Code extensions are installed via scripts/code.sh
# See config/vscode/extensions for the list
