# ============================================================================
# Unified Brewfile - macOS Development Setup
# ============================================================================
# Installation: brew bundle --file=Brewfile
# Or run: ./bootstrap.sh (which includes this)
# ============================================================================

# ----------------------------------------------------------------------------
# Taps
# ----------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# ----------------------------------------------------------------------------
# Shell & Terminal
# ----------------------------------------------------------------------------
brew "zsh"
brew "bash"
brew "bash-completion"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "tmux"
brew "screen"
cask "iterm2"

# ----------------------------------------------------------------------------
# Development Tools & IDEs
# ----------------------------------------------------------------------------
brew "git"
brew "gh"                    # GitHub CLI
brew "gitsign"              # Signing commits
brew "node"
brew "ruby"
brew "python@3.10"
brew "python@3.9"
brew "python3"
brew "go"
brew "rust"
brew "perl"
cask "visual-studio-code"
cask "goland"

# ----------------------------------------------------------------------------
# Version Managers
# ----------------------------------------------------------------------------
brew "pyenv"
brew "tfenv"

# ----------------------------------------------------------------------------
# Go Tools
# ----------------------------------------------------------------------------
brew "golangci-lint"
brew "goreleaser"
brew "gotests"

# ----------------------------------------------------------------------------
# Infrastructure as Code
# ----------------------------------------------------------------------------
brew "terraform"
brew "terragrunt"
brew "vault"
brew "hadolint"             # Dockerfile linter

# ----------------------------------------------------------------------------
# Kubernetes Tools
# ----------------------------------------------------------------------------
brew "kubernetes-cli"
brew "kubectx"
brew "kube-ps1"
brew "krew"
brew "kubeseal"
brew "helm"
brew "k3d"
brew "kind"
brew "minikube"
brew "skaffold"
brew "kustomize"
brew "tilt"

# ----------------------------------------------------------------------------
# Container Tools
# ----------------------------------------------------------------------------
brew "dive"                 # Explore Docker image layers
brew "crane"                # Container registry tool

# ----------------------------------------------------------------------------
# Cloud & Virtualization Tools
# ----------------------------------------------------------------------------
brew "localstack"           # AWS local testing
brew "multipass"            # Ubuntu VMs
brew "lima"                 # Linux virtual machines
brew "qemu"                 # Generic virtualization
brew "traefik"              # Reverse proxy

# ----------------------------------------------------------------------------
# DevOps & Cloud Tools
# ----------------------------------------------------------------------------
brew "jfrog-cli"
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "task"                 # Task runner
brew "opa"                  # Open Policy Agent
brew "cfssl"                # CloudFlare SSL
brew "ko"                   # Kubernetes image builder

# ----------------------------------------------------------------------------
# System Tools & CLI Utilities
# ----------------------------------------------------------------------------
brew "make"
brew "tree"
brew "wget"
brew "vim"
brew "postgresql@14"
brew "libssh"
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast grep alternative
brew "fd"                   # Fast find alternative
brew "direnv"               # Directory-based env vars
brew "bats"                 # Bash testing framework
brew "tldr"                 # Simplified man pages
brew "shellcheck"           # Shell script linter
brew "telnet"
brew "proctools"
brew "pstree"
brew "coreutils"
brew "findutils"
brew "grep"
brew "less"
brew "gawk"
brew "gnutls"
brew "parallel"
brew "ncdu"                 # Disk usage analyzer
brew "watch"
brew "openssl"
brew "openssh"
brew "protobuf"

# ----------------------------------------------------------------------------
# Security & Encryption
# ----------------------------------------------------------------------------
brew "gnupg"
brew "gpg"
cask "keybase"

# ----------------------------------------------------------------------------
# Desktop Applications
# ----------------------------------------------------------------------------
cask "rectangle"            # Window management
cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"
cask "coconutbattery"       # Battery health monitor

# ----------------------------------------------------------------------------
# Fonts (for Powerlevel10k)
# ----------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"

# ----------------------------------------------------------------------------
# VS Code Extensions
# ----------------------------------------------------------------------------
# DevOps & Cloud
vscode "hashicorp.terraform"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-bicep"
vscode "redhat.vscode-yaml"

# Git & GitHub
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "github.vscode-github-actions"

# Programming Languages
vscode "golang.go"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.isort"
vscode "rust-lang.rust-analyzer"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"

# Data & Notebooks
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# Markdown & Documentation
vscode "bierner.markdown-mermaid"
vscode "DavidAnson.vscode-markdownlint"
vscode "yzhang.markdown-all-in-one"
vscode "bierner.markdown-preview-github-styles"

# Utilities & UI
vscode "hediet.vscode-drawio"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "vscode-icons-team.vscode-icons"
vscode "ritwickdey.LiveServer"
vscode "vscodevim.vim"
vscode "asvetliakov.vscode-neovim"

# Remote Development
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"

# Other Tools
vscode "ms-vscode.makefile-tools"
vscode "JFrog.jfrog-vscode-extension"
vscode "run-at-scale.terraform-doc-snippets"
vscode "tilt-dev.tiltfile"
vscode "tsandall.opa"
vscode "aaron-bond.better-comments"
vscode "formulahendry.code-runner"
vscode "WakaTime.vscode-wakatime"
