aaron-bond.better-comments
astro-build.astro-vscode
asvetliakov.vscode-neovim
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bradlc.vscode-tailwindcss
bungcip.better-toml
csstools.postcss
dariofuzinato.vue-peek
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
dracula-theme.theme-dracula
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
foxundermoon.next-js
gencay.vscode-chatgpt
GitHub.copilot
github.vscode-github-actions
golang.go
hashicorp.terraform
hediet.vscode-drawio
hylwxqwq.yuyuko-vim-vsc
JuanBlanco.solidity
mads-hartmann.bash-ide-vscode
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ja
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
onflow.cadence
Orta.vscode-jest
PKief.material-icon-theme
Prisma.prisma
redhat.vscode-yaml
ritwickdey.LiveServer
rust-lang.rust-analyzer
taichi.vscode-textlint
vadimcn.vscode-lldb
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vmsynkov.colonize
vscodevim.vim
vsls-contrib.gistfs
Vue.volar
WakaTime.vscode-wakatime
xaver.clang-format
yoavbls.pretty-ts-errors
zxh404.vscode-proto3
