# System Tools
brew 'git'
brew 'zsh'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'bat'
brew 'icdiff'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git-delta'
brew 'dyff'
brew 'git' # No force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'gitsign'
brew 'gh'
brew 'hg'
brew 'interactive-rebase-tool'
brew 'gti'
brew 'prm'
brew 'go'
brew 'fzf'
brew 'grv'
brew 'jq'
brew 'jless'
brew 'node'
brew 'rust'
brew 'ruby'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'protobuf'
brew 'prototool'
brew 'dog'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'entr'
brew 'direnv'
brew 'bats'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'fortio'
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'
brew 'kind'
brew 'multipass'

# Containers and Kubernetes
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'kind'
brew 'docker-machine-driver-hyperkit'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
brew 'ko'
brew 'dive'
brew 'crane'
brew 'gpg'

# Version Control and Signing
brew 'gnupg'
cask 'keybase'

# Development and Code Tools
cask 'iterm2'
cask 'visual-studio-code'
cask 'goland'
brew 'node'
brew 'ruby'
brew 'python@3.10'
brew 'python@3.9'
brew 'terraform'
brew 'tfenv'
brew 'go'
brew 'golangci-lint'
brew 'goreleaser'
brew 'gotests'
brew 'hadolint'
brew 'helm'
brew 'jfrog-cli'
brew 'jq'
brew 'k3d'
brew 'kind'
brew 'kubernetes-cli'
brew 'krew'
brew 'kubectx'
brew 'kubeseal'
brew 'libssh'
brew 'qemu'
brew 'lima'
brew 'localstack'
brew 'make'
brew 'minikube'
brew 'node'
brew 'opa'
brew 'perl'
brew 'postgresql@14'
brew 'pyenv'
brew 'python@3.10'
brew 'python@3.9'
brew 'task'
brew 'terraform'
brew 'tfenv'
brew 'tilt'
brew 'traefik'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yq'
brew 'zsh'

# Desktop Software
cask 'clipy'
cask 'vimac'
cask 'zoomus'
cask 'flux'
cask 'slack'
cask 'rectangle'
cask 'google-chrome'
cask 'coconutbattery'
cask 'firefox'
cask 'open-in-code'
cask 'bitbar'
cask 'discord'

# Visual Studio Code Extensions
vscode "bierner.markdown-mermaid"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "JFrog.jfrog-vscode-extension"
vscode "johnpapa.winteriscoming"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "puppet.puppet-vscode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "run-at-scale.terraform-doc-snippets"
vscode "tilt-dev.tiltfile"
vscode "tsandall.opa"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"

