tap "aquasecurity/trivy"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "python@3.10"
brew "ansible"
brew "argocd"
brew "bat"
brew "berkeley-db", link: true
brew "cfssl"
brew "consul-template"
brew "desk"
brew "docker"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "python@3.9"
brew "glib"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "gotests"
brew "grep"
brew "hadolint"
brew "helm"
brew "jenkins-lts", restart_service: true
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "qemu"
brew "lima"
brew "localstack"
brew "make"
brew "minikube"
brew "node"
brew "openjdk"
brew "openssl@3"
brew "pyenv"
brew "ruby"
brew "task", link: false
brew "terraform"
brew "tfenv"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/vault"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password"
cask "google-cloud-sdk"
cask "iterm2"
cask "notion"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "zoom"
