tap "aquasecurity/trivy"
tap "aws/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k8sgpt-ai/k8sgpt"
tap "romkatv/powerlevel10k"
tap "spacelift-io/spacelift"
tap "terraform-docs/tap"
brew "akamai", link: false
brew "python@3.11"
brew "ansible"
brew "argocd"
brew "awscli"
brew "bat"
brew "berkeley-db"
brew "glib"
brew "cfssl"
brew "consul-template"
brew "desk"
brew "docker", link: false
brew "exa"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "golangci-lint"
brew "goreleaser"
brew "gotests"
brew "grep"
brew "hadolint"
brew "helm"
brew "jenkins-lts", restart_service: true
brew "jfrog-cli"
brew "jq"
brew "k3d"
brew "kind"
brew "kubernetes-cli", link: false
brew "krew"
brew "kubectx"
brew "kubeseal"
brew "libssh"
brew "qemu"
brew "lima"
brew "localstack"
brew "make"
brew "minikube"
brew "node"
brew "opa"
brew "perl"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "task", link: false
brew "terraform"
brew "tfenv"
brew "tilt"
brew "traefik"
brew "tree"
brew "vim"
brew "wget"
brew "yq"
brew "zsh"
brew "aquasecurity/trivy/trivy"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/vault"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "google-cloud-sdk"
cask "notion"
cask "pb"
vscode "bierner.markdown-mermaid"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "JFrog.jfrog-vscode-extension"
vscode "johnpapa.winteriscoming"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-aks-tools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "puppet.puppet-vscode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "run-at-scale.terraform-doc-snippets"
vscode "tilt-dev.tiltfile"
vscode "tsandall.opa"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
